99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/camera/esp32_mquickjs_camera.c
#include "esp32_mquickjs_camera.h"
#include "esp32_mquickjs_memory.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_peripheral_lease.h"
#include "utils/esp32_mquickjs_byte_source.h"

#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/ledc.h"
#include "esp_camera.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_memory_utils.h"
#if CONFIG_SPIRAM
#include "esp_psram.h"
#endif
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "sensor.h"
#include "soc/soc_caps.h"

#define CAMERA_REQUIRED_PIN_MISSING (-2)
#define CAMERA_DEFAULT_TIMEOUT_MS 5000U
#define CAMERA_DEFAULT_CHUNK_BYTES 4096U
#define CAMERA_MAX_CHUNK_BYTES (32U * 1024U)
#define CAMERA_MAX_COPY_BYTES (32U * 1024U)
#define CAMERA_SCCB_I2C_PORT 1
#define CAMERA_FRAME_OWNER_KEY "__esp32qjsCameraFrameOwner"

/*
 * esp32-camera exposes only a fixed four-second esp_camera_fb_get() wait.
 * The component version pinned by this project exports cam_take(), which lets
 * the adapter keep the public Camera.capture(timeoutMs) contract and poll
 * cancellation without modifying the dependency.
 */
extern camera_fb_t *cam_take(TickType_t timeout);

static bool camera_psram_is_initialized(void)
{
#if CONFIG_SPIRAM
    return esp_psram_is_initialized();
#else
    return false;
#endif
}

static size_t camera_psram_size(void)
{
#if CONFIG_SPIRAM
    return esp_psram_get_size();
#else
    return 0;
#endif
}

typedef struct {
    uint32_t generation;
} esp32_mquickjs_camera_ref_t;

typedef struct {
    uint32_t camera_generation;
    uint32_t frame_generation;
} esp32_mquickjs_camera_frame_ref_t;

typedef struct esp32_mquickjs_camera_source esp32_mquickjs_camera_source_t;

typedef struct {
    bool allocated;
    bool initialized;
    bool busy;
    bool release_pending;
    uint32_t generation;
    uint32_t frame_generation;
    uint32_t sequence;
    uint32_t default_timeout_ms;
    pixformat_t pixel_format;
    framesize_t frame_size;
    int jpeg_quality;
    size_t frame_buffers;
    camera_grab_mode_t grab_mode;
    camera_fb_location_t buffer_location;
    sensor_t *sensor;
    camera_fb_t *leased_fb;
    bool frame_revoked;
    bool source_active;
    esp32_mquickjs_camera_source_t *source;
    uint16_t bitmap_read_leases;
    esp32_mquickjs_future_driver_state_t *capture_state;
    esp32_mquickjs_future_driver_state_t *close_state;
    esp32_mquickjs_peripheral_lease_t camera_lease;
    esp32_mquickjs_peripheral_lease_t i2c_lease;
    esp32_mquickjs_peripheral_lease_t ledc_timer_lease;
    esp32_mquickjs_peripheral_lease_t ledc_channel_lease;
} esp32_mquickjs_camera_slot_t;

struct esp32_mquickjs_camera_source {
    uint32_t camera_generation;
    uint32_t frame_generation;
    size_t chunk_bytes;
    size_t offset;
    bool opened;
    bool iterator_active;
    bool consumed;
    bool destroy_requested;
};

struct esp32_mquickjs_future_driver_state {
    JSContext *ctx;
    JSGCRef owner_ref;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    uint32_t camera_generation;
    uint32_t timeout_ms;
    uint64_t started_us;
    framesize_t frame_size;
    pixformat_t pixel_format;
    camera_fb_t *frame;
    bool owner_retained;
    bool started;
    bool cleanup_started;
    bool cleanup_submitted;
    bool cleanup_finalized;
    bool close_initialized;
    volatile bool completed;
    volatile bool cancelled;
    esp_err_t close_result;
};

static esp32_mquickjs_camera_slot_t s_camera;
static uint32_t s_camera_next_generation = 1;

static uint32_t camera_take_generation(void)
{
    uint32_t generation = s_camera_next_generation++;

    if (generation == 0) {
        generation = s_camera_next_generation++;
    }
    return generation;
}

static bool camera_to_i32(JSContext *ctx, JSValue value, int *out)
{
    double number;
    int converted;

    if (!JS_IsNumber(ctx, value) ||
        JS_ToNumber(ctx, &number, value) != 0 || !isfinite(number) ||
        number < INT32_MIN || number > INT32_MAX) {
        return false;
    }
    converted = (int)number;
    if ((double)converted != number) {
        return false;
    }
    *out = converted;
    return true;
}

static bool camera_to_u32(JSContext *ctx, JSValue value, uint32_t *out)
{
    int raw;

    if (!camera_to_i32(ctx, value, &raw) || raw < 0) {
        return false;
    }
    *out = (uint32_t)raw;
    return true;
}

static bool camera_to_bool(JSContext *ctx, JSValue value, bool *out)
{
    (void)ctx;
    if (!JS_IsBool(value)) {
        return false;
    }
    *out = value == JS_TRUE;
    return true;
}

static const char *camera_pixel_format_name(pixformat_t format)
{
    switch (format) {
    case PIXFORMAT_JPEG:
        return "jpeg";
    case PIXFORMAT_GRAYSCALE:
        return "grayscale";
    case PIXFORMAT_RGB565:
        return "rgb565";
    default:
        return "unknown";
    }
}

static bool camera_parse_pixel_format(JSContext *ctx, JSValue value,
                                      pixformat_t *out)
{
    JSCStringBuf buffer;
    const char *text;

    if (!JS_IsString(ctx, value) ||
        (text = JS_ToCString(ctx, value, &buffer)) == NULL) {
        return false;
    }
    if (strcmp(text, "jpeg") == 0) {
        *out = PIXFORMAT_JPEG;
    } else if (strcmp(text, "grayscale") == 0) {
        *out = PIXFORMAT_GRAYSCALE;
    } else if (strcmp(text, "rgb565") == 0) {
        *out = PIXFORMAT_RGB565;
    } else {
        return false;
    }
    return true;
}

typedef struct {
    const char *name;
    framesize_t value;
} camera_frame_size_entry_t;

static const camera_frame_size_entry_t s_frame_sizes[] = {
    {"96x96", FRAMESIZE_96X96},
    {"qqvga", FRAMESIZE_QQVGA},
    {"qcif", FRAMESIZE_QCIF},
    {"hqvga", FRAMESIZE_HQVGA},
    {"qvga", FRAMESIZE_QVGA},
    {"cif", FRAMESIZE_CIF},
    {"vga", FRAMESIZE_VGA},
    {"svga", FRAMESIZE_SVGA},
    {"xga", FRAMESIZE_XGA},
    {"sxga", FRAMESIZE_SXGA},
    {"uxga", FRAMESIZE_UXGA},
};

static const char *camera_frame_size_name(framesize_t value)
{
    size_t i;

