99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/camera/esp32_mquickjs_camera.c
    for (i = 0; i < sizeof(s_frame_sizes) / sizeof(s_frame_sizes[0]); ++i) {
        if (s_frame_sizes[i].value == value) {
            return s_frame_sizes[i].name;
        }
    }
    return "unknown";
}

static bool camera_parse_frame_size(JSContext *ctx, JSValue value,
                                    framesize_t *out)
{
    JSCStringBuf buffer;
    const char *text;
    size_t i;

    if (!JS_IsString(ctx, value) ||
        (text = JS_ToCString(ctx, value, &buffer)) == NULL) {
        return false;
    }
    for (i = 0; i < sizeof(s_frame_sizes) / sizeof(s_frame_sizes[0]); ++i) {
        if (strcmp(text, s_frame_sizes[i].name) == 0) {
            *out = s_frame_sizes[i].value;
            return true;
        }
    }
    return false;
}

static const char *camera_sensor_model(const sensor_t *sensor)
{
    if (sensor == NULL) {
        return "unknown";
    }
    if (sensor->id.PID == OV2640_PID) {
        return "ov2640";
    }
    if (sensor->id.PID == OV3660_PID) {
        return "ov3660";
    }
    return "unknown";
}

static bool camera_slot_matches(uint32_t generation)
{
    return s_camera.allocated && s_camera.generation == generation;
}

static bool camera_frame_storage_matches(uint32_t camera_generation,
                                         uint32_t frame_generation)
{
    return camera_slot_matches(camera_generation) &&
           s_camera.leased_fb != NULL &&
           s_camera.frame_generation == frame_generation;
}

static bool camera_frame_matches(uint32_t camera_generation,
                                 uint32_t frame_generation)
{
    return camera_frame_storage_matches(camera_generation,
                                        frame_generation) &&
           !s_camera.frame_revoked;
}

static void camera_cleanup(void);
static void camera_close_schedule_cleanup(
    esp32_mquickjs_future_driver_state_t *state);

static void camera_cleanup_if_ready(void)
{
    if (s_camera.release_pending && !s_camera.busy &&
        s_camera.leased_fb == NULL && !s_camera.source_active &&
        s_camera.bitmap_read_leases == 0) {
        if (s_camera.close_state != NULL) {
            camera_close_schedule_cleanup(s_camera.close_state);
        } else {
            camera_cleanup();
        }
    }
}

static void camera_release_frame(void)
{
    if (s_camera.source_active || s_camera.bitmap_read_leases != 0) {
        return;
    }
    if (s_camera.leased_fb != NULL) {
        esp_camera_fb_return(s_camera.leased_fb);
        s_camera.leased_fb = NULL;
    }
    s_camera.frame_revoked = false;
    camera_cleanup_if_ready();
}

static void camera_revoke_frame(void)
{
    esp32_mquickjs_camera_source_t *source = s_camera.source;

    if (s_camera.leased_fb == NULL) {
        return;
    }
    s_camera.frame_revoked = true;
    if (source != NULL) {
        source->consumed = true;
        if (!source->iterator_active) {
            s_camera.source_active = false;
            s_camera.source = NULL;
        }
    }
    camera_release_frame();
}

static void camera_release_leases(void)
{
    esp32_mquickjs_peripheral_lease_release(&s_camera.ledc_channel_lease);
    esp32_mquickjs_peripheral_lease_release(&s_camera.ledc_timer_lease);
    esp32_mquickjs_peripheral_lease_release(&s_camera.i2c_lease);
    esp32_mquickjs_peripheral_lease_release(&s_camera.camera_lease);
}

static void camera_cleanup(void)
{
    if (!s_camera.allocated || s_camera.busy || s_camera.source_active ||
        s_camera.bitmap_read_leases != 0) {
        return;
    }
    s_camera.release_pending = false;
    camera_release_frame();
    if (s_camera.initialized) {
        (void)esp_camera_deinit();
    }
    camera_release_leases();
    memset(&s_camera, 0, sizeof(s_camera));
}

static int camera_from_value(JSContext *ctx, JSValue value,
                             const char *api_name,
                             esp32_mquickjs_camera_ref_t **out_ref)
{
    esp32_mquickjs_camera_ref_t *ref;

    if (JS_GetClassID(ctx, value) != JS_CLASS_CAMERA ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "%s expects a Camera", api_name);
        return -1;
    }
    if (!camera_slot_matches(ref->generation)) {
        JS_ThrowReferenceError(ctx, "%s failed because the Camera is closed",
                               api_name);
        return -1;
    }
    if (out_ref != NULL) {
        *out_ref = ref;
    }
    return 0;
}

static int camera_frame_from_value(
    JSContext *ctx, JSValue value, const char *api_name,
    esp32_mquickjs_camera_frame_ref_t **out_ref)
{
    esp32_mquickjs_camera_frame_ref_t *ref;

    if (JS_GetClassID(ctx, value) != JS_CLASS_CAMERA_FRAME ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "%s expects a CameraFrame", api_name);
        return -1;
    }
    if (!camera_frame_matches(ref->camera_generation,
                              ref->frame_generation)) {
        JS_ThrowReferenceError(ctx,
                               "%s failed because the CameraFrame is closed",
                               api_name);
        return -1;
    }
    if (out_ref != NULL) {
        *out_ref = ref;
    }
    return 0;
}

bool esp32_mquickjs_camera_frame_acquire_bitmap_view(
    JSContext *ctx,
    JSValue value,
    const char *api_name,
    esp32_mquickjs_camera_bitmap_lease_t *out_lease)
{
    esp32_mquickjs_camera_frame_ref_t *ref;
    camera_fb_t *frame;
    esp32_mquickjs_bitmap_pixel_format_t format;
    uint32_t bytes_per_pixel;
    size_t required;

    if (out_lease == NULL) {
        return false;
    }
    memset(out_lease, 0, sizeof(*out_lease));
    if (camera_frame_from_value(ctx, value, api_name, &ref) != 0) {
        return false;
    }
    if (s_camera.source_active) {
        JS_ThrowInternalError(
            ctx, "%s failed because the CameraFrame is busy", api_name);
        return false;
    }
    frame = s_camera.leased_fb;
    switch (frame->format) {
        case PIXFORMAT_GRAYSCALE:
            format = ESP32_MQUICKJS_BITMAP_FORMAT_GRAY8;
            bytes_per_pixel = 1U;
            break;
        case PIXFORMAT_RGB565:
            format = ESP32_MQUICKJS_BITMAP_FORMAT_RGB565;
            bytes_per_pixel = 2U;
            break;
        case PIXFORMAT_RGB888:
            format = ESP32_MQUICKJS_BITMAP_FORMAT_RGB888;
            bytes_per_pixel = 3U;
            break;
        default:
            JS_ThrowTypeError(
                ctx,
                "%s requires a raw grayscale, rgb565, or rgb888 CameraFrame; decode JPEG/BMP separately",
                api_name);
            return false;
    }
    if (frame->width == 0 || frame->height == 0 ||
        frame->width > UINT32_MAX || frame->height > UINT32_MAX ||
        frame->width > UINT32_MAX / bytes_per_pixel ||
        frame->height > SIZE_MAX / (frame->width * bytes_per_pixel)) {
        JS_ThrowInternalError(ctx, "%s received invalid CameraFrame dimensions",
                              api_name);
        return false;
    }
    required = frame->width * frame->height * bytes_per_pixel;
    if (required > frame->len) {
        JS_ThrowInternalError(ctx, "%s received a truncated CameraFrame",
                              api_name);
        return false;
    }
    if (s_camera.bitmap_read_leases == UINT16_MAX) {
        JS_ThrowInternalError(ctx, "%s could not acquire a CameraFrame read lease",
                              api_name);
        return false;
    }
    ++s_camera.bitmap_read_leases;
    out_lease->view.data = frame->buf;
    out_lease->view.length = frame->len;
    out_lease->view.width = (uint32_t)frame->width;
    out_lease->view.height = (uint32_t)frame->height;
    out_lease->view.stride = (uint32_t)frame->width * bytes_per_pixel;
    out_lease->view.format = format;
    out_lease->view.layout = ESP32_MQUICKJS_BITMAP_LAYOUT_LINEAR;
    out_lease->view.byte_order = ESP32_MQUICKJS_BITMAP_BYTE_ORDER_BE;
    out_lease->view.bit_order = ESP32_MQUICKJS_BITMAP_BIT_ORDER_LSB;
    out_lease->camera_generation = ref->camera_generation;
    out_lease->frame_generation = ref->frame_generation;
    out_lease->active = true;
    return true;
}

void esp32_mquickjs_camera_frame_release_bitmap_view(
    esp32_mquickjs_camera_bitmap_lease_t *lease)
{
    if (lease == NULL || !lease->active) {
        return;
    }
    if (camera_frame_storage_matches(lease->camera_generation,
                                     lease->frame_generation) &&
        s_camera.bitmap_read_leases != 0) {
        --s_camera.bitmap_read_leases;
    }
    lease->active = false;
    if (s_camera.frame_revoked) {
        camera_release_frame();
    } else {
        camera_cleanup_if_ready();
    }
}

static JSValue camera_make_object(JSContext *ctx)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    esp32_mquickjs_camera_ref_t *ref;

    *object = JS_NewObjectClassUser(ctx, JS_CLASS_CAMERA);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    ref = heap_caps_malloc(sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    ref->generation = s_camera.generation;
    JS_SetOpaque(ctx, *object, ref);
    return JS_PopGCRef(ctx, &object_ref);
}

static uint64_t camera_frame_timestamp_us(const camera_fb_t *frame)
{
    return frame == NULL ? 0 :
        (uint64_t)frame->timestamp.tv_sec * 1000000ULL +
        (uint64_t)frame->timestamp.tv_usec;
}

static JSValue camera_make_frame_object(JSContext *ctx, JSValue camera_owner)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    esp32_mquickjs_camera_frame_ref_t *ref;
    camera_fb_t *frame = s_camera.leased_fb;

