99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/camera/esp32_mquickjs_camera.c
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_CAMERA_FRAME);
    if (JS_IsException(*object) || frame == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    ref = heap_caps_malloc(sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    ref->camera_generation = s_camera.generation;
    ref->frame_generation = s_camera.frame_generation;
    JS_SetOpaque(ctx, *object, ref);
    if (!esp32_mquickjs_set_property_ref(ctx, object, "width",
                                         JS_NewInt64(ctx, frame->width)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "height",
                                         JS_NewInt64(ctx, frame->height)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "format",
            JS_NewString(ctx, camera_pixel_format_name(frame->format))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "byteLength",
                                         JS_NewInt64(ctx, frame->len)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "timestampUs",
            JS_NewInt64(ctx, (int64_t)camera_frame_timestamp_us(frame))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "sequence",
            JS_NewUint32(ctx, s_camera.sequence++)) ||
        !esp32_mquickjs_set_property_ref(ctx, object,
                                         CAMERA_FRAME_OWNER_KEY,
                                         camera_owner)) {
        JS_SetOpaque(ctx, *object, NULL);
        heap_caps_free(ref);
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

static bool camera_source_next(JSContext *ctx, void *opaque,
                               esp32_mquickjs_byte_span_t *out)
{
    esp32_mquickjs_camera_source_t *source = opaque;
    camera_fb_t *frame;
    size_t remaining;
    size_t length;

    (void)ctx;
    if (source == NULL || source->destroy_requested || source->consumed ||
        !camera_frame_matches(source->camera_generation,
                              source->frame_generation)) {
        return false;
    }
    frame = s_camera.leased_fb;
    if (source->offset >= frame->len) {
        source->consumed = true;
        return false;
    }
    remaining = frame->len - source->offset;
    length = remaining < source->chunk_bytes ? remaining : source->chunk_bytes;
    out->data = frame->buf + source->offset;
    out->length = length;
    out->owner = JS_UNDEFINED;
    out->dma_capable = esp_ptr_dma_capable(out->data);
    source->offset += length;
    return true;
}

static void camera_source_iterator_close(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_camera_source_t *source = opaque;

    (void)ctx;
    if (source == NULL) {
        return;
    }
    source->iterator_active = false;
    source->consumed = true;
    if (camera_frame_storage_matches(source->camera_generation,
                                     source->frame_generation)) {
        if (s_camera.source == source) {
            s_camera.source = NULL;
            s_camera.source_active = false;
        }
        camera_release_frame();
    }
    if (source->destroy_requested) {
        heap_caps_free(source);
    }
}

static bool camera_source_open(JSContext *ctx, JSValue source_value,
                               void *opaque,
                               esp32_mquickjs_byte_span_source_t *out,
                               JSValue *out_error)
{
    esp32_mquickjs_camera_source_t *source = opaque;

    (void)source_value;
    if (source == NULL || source->opened || source->consumed ||
        source->destroy_requested ||
        !camera_frame_matches(source->camera_generation,
                              source->frame_generation)) {
        *out_error = JS_ThrowReferenceError(
            ctx, "CameraFrame source is closed or has already been consumed");
        return false;
    }
    source->opened = true;
    source->iterator_active = true;
    out->opaque = source;
    out->next = camera_source_next;
    out->close = camera_source_iterator_close;
    return true;
}

static size_t camera_source_known_length(void *opaque)
{
    esp32_mquickjs_camera_source_t *source = opaque;

    return source != NULL &&
                   camera_frame_matches(source->camera_generation,
                                        source->frame_generation)
               ? s_camera.leased_fb->len
               : 0;
}

static void camera_source_destroy(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_camera_source_t *source = opaque;

    (void)ctx;
    if (source == NULL) {
        return;
    }
    if (source->iterator_active) {
        source->destroy_requested = true;
        source->consumed = true;
        return;
    }
    if (camera_frame_storage_matches(source->camera_generation,
                                     source->frame_generation)) {
        if (s_camera.source == source) {
            s_camera.source = NULL;
            s_camera.source_active = false;
        }
        camera_release_frame();
    }
    heap_caps_free(source);
}

static const esp32_mquickjs_byte_span_source_object_ops_t s_camera_source_ops = {
    .class_id = JS_CLASS_BYTE_SPAN_SOURCE,
    .open = camera_source_open,
    .known_length = camera_source_known_length,
    .destroy = camera_source_destroy,
};

static void camera_capture_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    uint64_t elapsed_us;

    if (state == NULL) {
        return;
    }
    for (;;) {
        if (state->cancelled) {
            break;
        }
        elapsed_us = (uint64_t)esp_timer_get_time() - state->started_us;
        if (state->timeout_ms > 0 &&
            elapsed_us >= (uint64_t)state->timeout_ms * 1000ULL) {
            break;
        }
        if (esp_camera_available_frames()) {
            state->frame = cam_take(1);
            if (state->frame != NULL) {
                state->frame->width = resolution[state->frame_size].width;
                state->frame->height = resolution[state->frame_size].height;
                state->frame->format = state->pixel_format;
                break;
            }
        }
        if (state->timeout_ms == 0) {
            break;
        }
        vTaskDelay(1);
    }
    state->completed = true;
}

static bool camera_capture_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_camera_ref_t *camera_ref;
    uint32_t timeout_ms;
    JSValue *owner;

    if (out_state == NULL || argc > 1 ||
        camera_from_value(ctx, this_ref->val, "Camera.capture()",
                          &camera_ref) != 0) {
        return false;
    }
    timeout_ms = s_camera.default_timeout_ms;
    if (argc == 1 && !JS_IsUndefined(argv[0].val) &&
        !camera_to_u32(ctx, argv[0].val, &timeout_ms)) {
        JS_ThrowTypeError(ctx,
                          "Camera.capture(timeoutMs?) expects a non-negative integer");
        return false;
    }
    if (s_camera.busy) {
        JS_ThrowInternalError(ctx, "Camera already has a pending capture");
        return false;
    }
    if (s_camera.leased_fb != NULL) {
        JS_ThrowInternalError(ctx,
                              "Camera.capture() requires the previous frame to be closed");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->camera_generation = camera_ref->generation;
    state->timeout_ms = timeout_ms;
    owner = JS_AddGCRef(ctx, &state->owner_ref);
    *owner = this_ref->val;
    state->owner_retained = true;
    *out_state = state;
    return true;
}

static bool camera_capture_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || !camera_slot_matches(state->camera_generation)) {
        JS_ThrowReferenceError(ctx, "Camera closed before capture started");
        return false;
    }
    if (s_camera.busy) {
        JS_ThrowInternalError(ctx, "Camera already has a pending capture");
        return false;
    }
    s_camera.busy = true;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    state->started_us = (uint64_t)esp_timer_get_time();
    state->frame_size = s_camera.frame_size;
    state->pixel_format = s_camera.pixel_format;
    s_camera.capture_state = state;
    if (!esp32_mquickjs_future_submit_worker(runtime, token,
                                             camera_capture_worker, state)) {
        JS_ThrowInternalError(ctx, "Camera capture worker queue is full");
        return false;
    }
    return true;
}

static esp32_mquickjs_future_poll_t camera_capture_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL && state->completed
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

