99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/camera/esp32_mquickjs_camera.c
static JSValue camera_capture_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    uint64_t elapsed_ms;
    JSValue result;

    if (state == NULL || state->cancelled) {
        return JS_ThrowInternalError(ctx, "Camera capture cancelled");
    }
    if (!camera_slot_matches(state->camera_generation) ||
        s_camera.release_pending) {
        return JS_ThrowReferenceError(ctx, "Camera closed during capture");
    }
    elapsed_ms = ((uint64_t)esp_timer_get_time() - state->started_us) / 1000ULL;
    if (state->frame == NULL ||
        (state->timeout_ms > 0 && elapsed_ms > state->timeout_ms)) {
        if (state->frame != NULL) {
            esp_camera_fb_return(state->frame);
            state->frame = NULL;
        }
        return JS_NULL;
    }
    s_camera.leased_fb = state->frame;
    state->frame = NULL;
    s_camera.frame_generation = camera_take_generation();
    result = camera_make_frame_object(ctx, state->owner_ref.val);
    if (JS_IsException(result)) {
        camera_release_frame();
    }
    return result;
}

static bool camera_capture_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    bool interrupted;

    if (state == NULL || state->cancelled) {
        return false;
    }
    interrupted = !state->completed;
    state->cancelled = true;
    if (state->started && camera_slot_matches(state->camera_generation)) {
        s_camera.release_pending = true;
    }
    return interrupted;
}

static void camera_capture_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    if (state->frame != NULL) {
        esp_camera_fb_return(state->frame);
    }
    if (state->started && camera_slot_matches(state->camera_generation)) {
        if (s_camera.capture_state == state) {
            s_camera.capture_state = NULL;
        }
        s_camera.busy = false;
        camera_cleanup_if_ready();
    }
    if (state->owner_retained) {
        JS_DeleteGCRef(state->ctx, &state->owner_ref);
    }
    heap_caps_free(state);
}

static const esp32_mquickjs_future_driver_t s_camera_capture_driver = {
    .prepare = camera_capture_prepare,
    .start = camera_capture_start,
    .poll = camera_capture_poll,
    .finish = camera_capture_finish,
    .cancel = camera_capture_cancel,
    .destroy = camera_capture_destroy,
};

static void camera_close_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    if (state == NULL) {
        return;
    }
    state->close_result = state->close_initialized
                              ? esp_camera_deinit()
                              : ESP_OK;
    state->completed = true;
}

static void camera_close_schedule_cleanup(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->cleanup_started ||
        !camera_slot_matches(state->camera_generation)) {
        return;
    }
    state->cleanup_started = true;
    state->cleanup_submitted = esp32_mquickjs_future_submit_worker(
        state->runtime, state->token, camera_close_worker, state);
    if (!state->cleanup_submitted) {
        state->completed = true;
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
}

static bool camera_close_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_camera_ref_t *camera_ref;
    JSValue *owner;

    (void)argv;
    if (out_state == NULL || argc != 0 ||
        JS_GetClassID(ctx, this_ref->val) != JS_CLASS_CAMERA) {
        JS_ThrowTypeError(ctx, "Camera.close() expects no arguments");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->close_result = ESP_OK;
    camera_ref = JS_GetOpaque(ctx, this_ref->val);
    if (camera_ref != NULL && camera_slot_matches(camera_ref->generation)) {
        state->camera_generation = camera_ref->generation;
        owner = JS_AddGCRef(ctx, &state->owner_ref);
        *owner = this_ref->val;
        state->owner_retained = true;
    }
    *out_state = state;
    return true;
}

static bool camera_close_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_camera_ref_t *camera_ref;

    if (state == NULL) {
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (state->camera_generation == 0 ||
        !camera_slot_matches(state->camera_generation)) {
        state->completed = true;
        (void)esp32_mquickjs_future_wake(runtime, token);
        return true;
    }
    if (s_camera.close_state != NULL) {
        JS_ThrowInternalError(ctx, "Camera close is already pending");
        return false;
    }
    camera_ref = JS_GetOpaque(ctx, state->owner_ref.val);
    if (camera_ref != NULL &&
        camera_ref->generation == state->camera_generation) {
        JS_SetOpaque(ctx, state->owner_ref.val, NULL);
        heap_caps_free(camera_ref);
    }
    state->close_initialized = s_camera.initialized;
    s_camera.release_pending = true;
    s_camera.close_state = state;
    if (s_camera.capture_state != NULL) {
        (void)camera_capture_cancel(s_camera.capture_state);
    }
    camera_revoke_frame();
    camera_cleanup_if_ready();
    return true;
}

static esp32_mquickjs_future_poll_t camera_close_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || !state->completed) {
        return ESP32_MQUICKJS_FUTURE_PENDING;
    }
    if (!state->cleanup_finalized) {
        if (!state->cleanup_submitted && state->close_initialized) {
            state->close_result = esp_camera_deinit();
        }
        if (camera_slot_matches(state->camera_generation) &&
            s_camera.close_state == state) {
            camera_release_leases();
            memset(&s_camera, 0, sizeof(s_camera));
        }
        state->cleanup_finalized = true;
    }
    return ESP32_MQUICKJS_FUTURE_READY;
}

static JSValue camera_close_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    (void)ctx;
    (void)state;
    return JS_TRUE;
}

