99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/camera/esp32_mquickjs_camera.c
static bool camera_close_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->completed) {
        return false;
    }
    state->cancelled = true;
    return false;
}

static void camera_close_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    if (state->owner_retained) {
        JS_DeleteGCRef(state->ctx, &state->owner_ref);
    }
    heap_caps_free(state);
}

static const esp32_mquickjs_future_driver_t s_camera_close_driver = {
    .prepare = camera_close_prepare,
    .start = camera_close_start,
    .poll = camera_close_poll,
    .finish = camera_close_finish,
    .cancel = camera_close_cancel,
    .destroy = camera_close_destroy,
};

static bool camera_register_future_driver(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef object_ref;
    JSGCRef capture_ref;
    JSGCRef close_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *capture = JS_PushGCRef(ctx, &capture_ref);
    JSValue *close = JS_PushGCRef(ctx, &close_ref);
    bool result;

    *object = JS_NewObjectClassUser(ctx, JS_CLASS_CAMERA);
    *capture = JS_IsException(*object)
                   ? JS_EXCEPTION
                   : JS_GetPropertyStr(ctx, *object, "capture");
    *close = JS_IsException(*object)
                 ? JS_EXCEPTION
                 : JS_GetPropertyStr(ctx, *object, "close");
    result = !JS_IsException(*capture) &&
             !JS_IsException(*close) &&
             esp32_mquickjs_future_register_driver(
                 ctx, runtime, *capture, &s_camera_capture_driver) &&
             esp32_mquickjs_future_register_driver(
                 ctx, runtime, *close, &s_camera_close_driver);
    if (!result && !JS_IsException(*object)) {
        JS_ThrowInternalError(ctx, "failed to register Camera Future driver");
    }
    JS_PopGCRef(ctx, &close_ref);
    JS_PopGCRef(ctx, &capture_ref);
    JS_PopGCRef(ctx, &object_ref);
    return result;
}

bool esp32_mquickjs_init_camera_runtime(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    if (s_camera.allocated && !s_camera.busy) {
        camera_cleanup();
    }
    memset(&s_camera, 0, sizeof(s_camera));
    return camera_register_future_driver(ctx, runtime);
}

void esp32_mquickjs_deinit_camera_runtime(JSContext *ctx)
{
    (void)ctx;
    if (!s_camera.allocated) {
        return;
    }
    s_camera.release_pending = true;
    if (!s_camera.busy) {
        camera_cleanup();
    }
}

JSValue js_camera_constructor(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "Camera cannot be constructed directly");
}

void js_camera_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_camera_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && camera_slot_matches(ref->generation)) {
        s_camera.release_pending = true;
        camera_cleanup_if_ready();
    }
    heap_caps_free(ref);
}

JSValue js_camera_capture(JSContext *ctx, JSValue *this_val,
                          int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *method = JS_GetPropertyStr(ctx, *this_val, "capture");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

static JSValue camera_make_status(JSContext *ctx)
{
    JSGCRef result_ref;
    JSGCRef sensor_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *sensor = JS_PushGCRef(ctx, &sensor_ref);

    *result = JS_NewObject(ctx);
    *sensor = JS_NewObject(ctx);
    if (JS_IsException(*result) || JS_IsException(*sensor) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "opened", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "capturePending",
                                         JS_NewBool(s_camera.busy)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "frameLeased",
                                         JS_NewBool(s_camera.leased_fb != NULL)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "pixelFormat",
            JS_NewString(ctx, camera_pixel_format_name(s_camera.pixel_format))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "frameSize",
            JS_NewString(ctx, camera_frame_size_name(s_camera.frame_size))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "jpegQuality",
                                         JS_NewInt32(ctx, s_camera.jpeg_quality)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "frameBuffers",
            JS_NewInt64(ctx, (int64_t)s_camera.frame_buffers)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "grabMode",
            JS_NewString(ctx, s_camera.grab_mode == CAMERA_GRAB_LATEST
                                  ? "latest" : "whenEmpty")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "bufferLocation",
            JS_NewString(ctx, s_camera.buffer_location == CAMERA_FB_IN_PSRAM
                                  ? "psram" : "dram")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, sensor, "model",
            JS_NewString(ctx, camera_sensor_model(s_camera.sensor))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, sensor, "pid",
            JS_NewUint32(ctx, s_camera.sensor != NULL
                                  ? s_camera.sensor->id.PID : 0)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "sensor", *sensor)) {
        JS_PopGCRef(ctx, &sensor_ref);
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    *sensor = JS_UNDEFINED;
    JS_PopGCRef(ctx, &sensor_ref);
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_camera_status(JSContext *ctx, JSValue *this_val,
                         int argc, JSValue *argv)
{
    (void)argc;
    (void)argv;
    if (camera_from_value(ctx, *this_val, "Camera.status()", NULL) != 0) {
        return JS_EXCEPTION;
    }
    return camera_make_status(ctx);
}

JSValue js_camera_controls(JSContext *ctx, JSValue *this_val,
                           int argc, JSValue *argv)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    camera_status_t *status;

    (void)argc;
    (void)argv;
    if (camera_from_value(ctx, *this_val, "Camera.controls()", NULL) != 0) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    status = &s_camera.sensor->status;
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "frameSize",
            JS_NewString(ctx, camera_frame_size_name(status->framesize))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "jpegQuality",
                                         JS_NewInt32(ctx, status->quality)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "brightness",
                                         JS_NewInt32(ctx, status->brightness)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "contrast",
                                         JS_NewInt32(ctx, status->contrast)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "saturation",
                                         JS_NewInt32(ctx, status->saturation)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "horizontalMirror",
                                         JS_NewBool(status->hmirror != 0)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "verticalFlip",
                                         JS_NewBool(status->vflip != 0))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

