99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/camera/esp32_mquickjs_camera.c
JSValue js_camera_set_control(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    JSCStringBuf name_buf;
    const char *name;
    int value = 0;
    int result = -1;
    bool bool_value;
    framesize_t frame_size;

    if (camera_from_value(ctx, *this_val, "Camera.setControl()", NULL) != 0) {
        return JS_EXCEPTION;
    }
    if (s_camera.busy) {
        return JS_ThrowInternalError(
            ctx, "Camera.setControl() refused while capture is pending");
    }
    if (argc != 2 || !JS_IsString(ctx, argv[0]) ||
        (name = JS_ToCString(ctx, argv[0], &name_buf)) == NULL) {
        return JS_ThrowTypeError(ctx,
                                 "Camera.setControl(name, value) expects two arguments");
    }
    if (strcmp(name, "frameSize") == 0) {
        if (!camera_parse_frame_size(ctx, argv[1], &frame_size)) {
            return JS_ThrowRangeError(ctx, "unsupported camera frame size");
        }
        result = s_camera.sensor->set_framesize(s_camera.sensor, frame_size);
        if (result == 0) {
            s_camera.frame_size = frame_size;
        }
    } else if (strcmp(name, "jpegQuality") == 0) {
        if (!camera_to_i32(ctx, argv[1], &value) || value < 0 || value > 63) {
            return JS_ThrowRangeError(ctx, "jpegQuality must be 0..63");
        }
        result = s_camera.sensor->set_quality(s_camera.sensor, value);
        if (result == 0) {
            s_camera.jpeg_quality = value;
        }
    } else if (strcmp(name, "brightness") == 0 ||
               strcmp(name, "contrast") == 0 ||
               strcmp(name, "saturation") == 0) {
        if (!camera_to_i32(ctx, argv[1], &value) || value < -2 || value > 2) {
            return JS_ThrowRangeError(ctx, "%s must be -2..2", name);
        }
        result = strcmp(name, "brightness") == 0
                     ? s_camera.sensor->set_brightness(s_camera.sensor, value)
                     : strcmp(name, "contrast") == 0
                           ? s_camera.sensor->set_contrast(s_camera.sensor, value)
                           : s_camera.sensor->set_saturation(s_camera.sensor, value);
    } else if (strcmp(name, "horizontalMirror") == 0 ||
               strcmp(name, "verticalFlip") == 0) {
        if (!camera_to_bool(ctx, argv[1], &bool_value)) {
            return JS_ThrowTypeError(ctx, "%s expects a boolean", name);
        }
        result = strcmp(name, "horizontalMirror") == 0
                     ? s_camera.sensor->set_hmirror(s_camera.sensor,
                                                    bool_value ? 1 : 0)
                     : s_camera.sensor->set_vflip(s_camera.sensor,
                                                  bool_value ? 1 : 0);
    } else {
        return JS_ThrowRangeError(ctx, "unsupported camera control: %s", name);
    }
    if (result != 0) {
        return JS_ThrowInternalError(ctx, "camera sensor rejected control %s", name);
    }
    return js_camera_controls(ctx, this_val, 0, NULL);
}

JSValue js_camera_close(JSContext *ctx, JSValue *this_val,
                        int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *method = JS_GetPropertyStr(ctx, *this_val, "close");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

JSValue js_camera_frame_constructor(JSContext *ctx, JSValue *this_val,
                                    int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx,
                             "CameraFrame cannot be constructed directly");
}

void js_camera_frame_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_camera_frame_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL &&
        camera_frame_storage_matches(ref->camera_generation,
                                     ref->frame_generation)) {
        camera_release_frame();
    }
    heap_caps_free(ref);
}

JSValue js_camera_frame_source(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    esp32_mquickjs_camera_frame_ref_t *ref;
    esp32_mquickjs_camera_source_t *source;
    uint32_t chunk_bytes = CAMERA_DEFAULT_CHUNK_BYTES;

    if (camera_frame_from_value(ctx, *this_val, "CameraFrame.source()", &ref) != 0) {
        return JS_EXCEPTION;
    }
    if (s_camera.source_active) {
        return JS_ThrowInternalError(ctx,
                                     "CameraFrame already has an active source");
    }
    if (s_camera.bitmap_read_leases != 0) {
        return JS_ThrowInternalError(
            ctx, "CameraFrame.source() failed because the CameraFrame is busy");
    }
    if (argc > 1) {
        return JS_ThrowTypeError(ctx,
                                 "CameraFrame.source(options?) expects at most one argument");
    }
    if (argc == 1 && !JS_IsUndefined(argv[0])) {
        JSValue property;

        if (JS_GetClassID(ctx, argv[0]) < 0 || JS_IsArray(ctx, argv[0])) {
            return JS_ThrowTypeError(ctx,
                                     "CameraFrame.source({ chunkBytes }) expects an object");
        }
        property = JS_GetPropertyStr(ctx, argv[0], "chunkBytes");
        if (JS_IsException(property) ||
            (!JS_IsUndefined(property) &&
             !camera_to_u32(ctx, property, &chunk_bytes))) {
            return JS_ThrowTypeError(ctx,
                                     "CameraFrame.source({ chunkBytes }) expects an integer");
        }
    }
    if (chunk_bytes == 0 || chunk_bytes > CAMERA_MAX_CHUNK_BYTES) {
        return JS_ThrowRangeError(ctx,
                                  "CameraFrame source chunkBytes must be 1..32768");
    }
    source = heap_caps_calloc(1, sizeof(*source), MALLOC_CAP_8BIT);
    if (source == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    source->camera_generation = ref->camera_generation;
    source->frame_generation = ref->frame_generation;
    source->chunk_bytes = chunk_bytes;
    s_camera.source_active = true;
    s_camera.source = source;
    return esp32_mquickjs_new_byte_span_source(ctx, *this_val,
                                               &s_camera_source_ops, source);
}

