99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/camera/esp32_mquickjs_camera.c
JSValue js_camera_frame_read(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    esp32_mquickjs_camera_frame_ref_t *ref;
    uint32_t offset = 0;
    uint32_t limit = CAMERA_MAX_COPY_BYTES;
    size_t length;
    uint8_t *copy = NULL;

    if (camera_frame_from_value(ctx, *this_val, "CameraFrame.read()", &ref) != 0) {
        return JS_EXCEPTION;
    }
    (void)ref;
    if (argc > 2 ||
        (argc >= 1 && !JS_IsUndefined(argv[0]) &&
         !camera_to_u32(ctx, argv[0], &offset)) ||
        (argc >= 2 && !JS_IsUndefined(argv[1]) &&
         !camera_to_u32(ctx, argv[1], &limit))) {
        return JS_ThrowTypeError(ctx,
                                 "CameraFrame.read(offset?, limit?) expects non-negative integers");
    }
    if (limit > CAMERA_MAX_COPY_BYTES) {
        return JS_ThrowRangeError(ctx,
                                  "CameraFrame.read() copies at most 32 KiB");
    }
    if ((size_t)offset > s_camera.leased_fb->len) {
        return JS_ThrowRangeError(ctx, "CameraFrame.read() offset is out of range");
    }
    length = s_camera.leased_fb->len - offset;
    if (length > limit) {
        length = limit;
    }
    if (length > 0) {
        copy = esp32_mquickjs_memory_payload_alloc(
            length, ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (copy == NULL) {
            return JS_ThrowOutOfMemory(ctx);
        }
        memcpy(copy, s_camera.leased_fb->buf + offset, length);
    }
    return esp32_mquickjs_new_owned_byte_view(ctx, copy, length);
}

JSValue js_camera_frame_close(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    esp32_mquickjs_camera_frame_ref_t *ref;
    JSValue owner_result;

    (void)argc;
    (void)argv;
    if (JS_GetClassID(ctx, *this_val) != JS_CLASS_CAMERA_FRAME) {
        return JS_ThrowTypeError(ctx,
                                 "CameraFrame.close() expects a CameraFrame");
    }
    ref = JS_GetOpaque(ctx, *this_val);
    if (ref == NULL) {
        return JS_TRUE;
    }
    if (!camera_frame_matches(ref->camera_generation, ref->frame_generation)) {
        owner_result = JS_SetPropertyStr(ctx, *this_val,
                                         CAMERA_FRAME_OWNER_KEY,
                                         JS_UNDEFINED);
        JS_SetOpaque(ctx, *this_val, NULL);
        heap_caps_free(ref);
        return JS_IsException(owner_result) ? JS_EXCEPTION : JS_TRUE;
    }
    if (s_camera.source_active) {
        return JS_ThrowInternalError(ctx,
                                     "CameraFrame.close() refused while a source is active");
    }
    if (s_camera.bitmap_read_leases != 0) {
        return JS_ThrowInternalError(
            ctx, "CameraFrame.close() failed because the CameraFrame is busy");
    }
    camera_release_frame();
    owner_result = JS_SetPropertyStr(ctx, *this_val, CAMERA_FRAME_OWNER_KEY,
                                     JS_UNDEFINED);
    JS_SetOpaque(ctx, *this_val, NULL);
    heap_caps_free(ref);
    return JS_IsException(owner_result) ? JS_EXCEPTION : JS_TRUE;
}

static JSValue camera_string_array(JSContext *ctx,
                                   const char *const *values,
                                   size_t count)
{
    JSGCRef array_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    size_t i;

    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array)) {
        JS_PopGCRef(ctx, &array_ref);
        return JS_EXCEPTION;
    }
    for (i = 0; i < count; ++i) {
        if (JS_IsException(JS_SetPropertyUint32(
                ctx, *array, (uint32_t)i, JS_NewString(ctx, values[i])))) {
            JS_PopGCRef(ctx, &array_ref);
            return JS_EXCEPTION;
        }
    }
    return JS_PopGCRef(ctx, &array_ref);
}

JSValue js_camera_capabilities(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    static const char *const sensors[] = {"ov2640", "ov3660"};
    static const char *const formats[] = {"jpeg", "grayscale", "rgb565"};
    const char *frame_names[sizeof(s_frame_sizes) / sizeof(s_frame_sizes[0])];
    JSGCRef result_ref;
    JSGCRef sensors_ref;
    JSGCRef formats_ref;
    JSGCRef sizes_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *sensor_values = JS_PushGCRef(ctx, &sensors_ref);
    JSValue *format_values = JS_PushGCRef(ctx, &formats_ref);
    JSValue *size_values = JS_PushGCRef(ctx, &sizes_ref);
    size_t i;

    (void)this_val;
    (void)argc;
    (void)argv;
    for (i = 0; i < sizeof(s_frame_sizes) / sizeof(s_frame_sizes[0]); ++i) {
        frame_names[i] = s_frame_sizes[i].name;
    }
    *result = JS_NewObject(ctx);
    *sensor_values = camera_string_array(
        ctx, sensors, sizeof(sensors) / sizeof(sensors[0]));
    *format_values = camera_string_array(
        ctx, formats, sizeof(formats) / sizeof(formats[0]));
    *size_values = camera_string_array(
        ctx, frame_names, sizeof(frame_names) / sizeof(frame_names[0]));
    if (JS_IsException(*result) || JS_IsException(*sensor_values) ||
        JS_IsException(*format_values) || JS_IsException(*size_values) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "target",
                                         JS_NewString(ctx, CONFIG_IDF_TARGET)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "psram",
                                         JS_NewBool(camera_psram_is_initialized())) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "psramBytes",
                                         JS_NewInt64(ctx, camera_psram_size())) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "sensorDrivers",
                                         *sensor_values) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "pixelFormats",
                                         *format_values) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "frameSizes",
                                         *size_values)) {
        JS_PopGCRef(ctx, &sizes_ref);
        JS_PopGCRef(ctx, &formats_ref);
        JS_PopGCRef(ctx, &sensors_ref);
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    *sensor_values = JS_UNDEFINED;
    *format_values = JS_UNDEFINED;
    *size_values = JS_UNDEFINED;
    JS_PopGCRef(ctx, &sizes_ref);
    JS_PopGCRef(ctx, &formats_ref);
    JS_PopGCRef(ctx, &sensors_ref);
    return JS_PopGCRef(ctx, &result_ref);
}

