99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/camera/esp32_mquickjs_camera.c
static int camera_profile_pin(const char *key)
{
    return esp32_mquickjs_profile_int_or(key, CAMERA_REQUIRED_PIN_MISSING);
}

static bool camera_read_optional_i32(JSContext *ctx, JSValue object,
                                     const char *name, int *value)
{
    JSValue property = JS_GetPropertyStr(ctx, object, name);

    return !JS_IsException(property) &&
           (JS_IsUndefined(property) || camera_to_i32(ctx, property, value));
}

JSValue js_camera_open(JSContext *ctx, JSValue *this_val,
                       int argc, JSValue *argv)
{
    camera_config_t config = {
        .pin_pwdn = camera_profile_pin("ESP32QJS_CAMERA_PWDN"),
        .pin_reset = camera_profile_pin("ESP32QJS_CAMERA_RESET"),
        .pin_xclk = camera_profile_pin("ESP32QJS_CAMERA_XCLK"),
        .pin_sccb_sda = camera_profile_pin("ESP32QJS_CAMERA_SCCB_SDA"),
        .pin_sccb_scl = camera_profile_pin("ESP32QJS_CAMERA_SCCB_SCL"),
        .pin_d7 = camera_profile_pin("ESP32QJS_CAMERA_D7"),
        .pin_d6 = camera_profile_pin("ESP32QJS_CAMERA_D6"),
        .pin_d5 = camera_profile_pin("ESP32QJS_CAMERA_D5"),
        .pin_d4 = camera_profile_pin("ESP32QJS_CAMERA_D4"),
        .pin_d3 = camera_profile_pin("ESP32QJS_CAMERA_D3"),
        .pin_d2 = camera_profile_pin("ESP32QJS_CAMERA_D2"),
        .pin_d1 = camera_profile_pin("ESP32QJS_CAMERA_D1"),
        .pin_d0 = camera_profile_pin("ESP32QJS_CAMERA_D0"),
        .pin_vsync = camera_profile_pin("ESP32QJS_CAMERA_VSYNC"),
        .pin_href = camera_profile_pin("ESP32QJS_CAMERA_HREF"),
        .pin_pclk = camera_profile_pin("ESP32QJS_CAMERA_PCLK"),
        .xclk_freq_hz = (int)esp32_mquickjs_profile_uint_or(
            "ESP32QJS_CAMERA_XCLK_FREQ_HZ", 20000000U),
        .pixel_format = PIXFORMAT_JPEG,
        .frame_size = FRAMESIZE_QVGA,
        .jpeg_quality = 12,
        .fb_count = 1,
        .fb_location = CAMERA_FB_IN_PSRAM,
        .grab_mode = CAMERA_GRAB_WHEN_EMPTY,
        .sccb_i2c_port = CAMERA_SCCB_I2C_PORT,
    };
    uint32_t timeout_ms = CAMERA_DEFAULT_TIMEOUT_MS;
    int frame_buffers = 1;
    esp_err_t err;
    JSValue result;
    int pins[] = {config.pin_xclk, config.pin_sccb_sda, config.pin_sccb_scl,
                  config.pin_d0, config.pin_d1, config.pin_d2, config.pin_d3,
                  config.pin_d4, config.pin_d5, config.pin_d6, config.pin_d7,
                  config.pin_vsync, config.pin_href, config.pin_pclk};
    size_t i;

    (void)this_val;
    if (argc > 1 || (argc == 1 && !JS_IsUndefined(argv[0]) &&
                     (JS_GetClassID(ctx, argv[0]) < 0 ||
                      JS_IsArray(ctx, argv[0])))) {
        return JS_ThrowTypeError(ctx, "camera.open(options?) expects an object");
    }
    if (s_camera.allocated) {
        return JS_ThrowInternalError(ctx, "camera.open() supports one Camera at a time");
    }
    if (argc == 1 && !JS_IsUndefined(argv[0])) {
        JSGCRef property_ref;
        JSGCRef pins_ref;
        JSValue *property = JS_PushGCRef(ctx, &property_ref);
        JSValue *pins_obj = JS_PushGCRef(ctx, &pins_ref);
        JSCStringBuf text_buf;
        const char *text;

        *property = JS_GetPropertyStr(ctx, argv[0], "sensor");
        if (JS_IsException(*property)) {
            goto parse_fail;
        }
        if (!JS_IsUndefined(*property)) {
            JS_ThrowTypeError(
                ctx,
                "camera.open() does not accept a sensor model; the driver probes it");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "pixelFormat");
        if (JS_IsException(*property) ||
            (!JS_IsUndefined(*property) &&
             !camera_parse_pixel_format(ctx, *property, &config.pixel_format))) {
            JS_ThrowRangeError(ctx, "camera.open() received unsupported pixelFormat");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "frameSize");
        if (JS_IsException(*property) ||
            (!JS_IsUndefined(*property) &&
             !camera_parse_frame_size(ctx, *property, &config.frame_size))) {
            JS_ThrowRangeError(ctx, "camera.open() received unsupported frameSize");
            goto parse_fail;
        }
        if (!camera_read_optional_i32(ctx, argv[0], "jpegQuality",
                                      &config.jpeg_quality) ||
            config.jpeg_quality < 0 || config.jpeg_quality > 63 ||
            !camera_read_optional_i32(ctx, argv[0], "frameBuffers",
                                      &frame_buffers) ||
            frame_buffers < 1 || frame_buffers > 2) {
            JS_ThrowRangeError(ctx, "camera.open() received invalid JPEG/DMA options");
            goto parse_fail;
        }
        if (!camera_read_optional_i32(ctx, argv[0], "xclkFreqHz",
                                      &config.xclk_freq_hz) ||
            config.xclk_freq_hz < 1000000 || config.xclk_freq_hz > 40000000) {
            JS_ThrowRangeError(ctx, "camera.open({ xclkFreqHz }) is out of range");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "timeoutMs");
        if (JS_IsException(*property) ||
            (!JS_IsUndefined(*property) &&
             !camera_to_u32(ctx, *property, &timeout_ms))) {
            JS_ThrowTypeError(ctx, "camera.open({ timeoutMs }) expects an integer");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "grabMode");
        if (JS_IsException(*property)) {
            goto parse_fail;
        }
        if (!JS_IsUndefined(*property)) {
            text = JS_ToCString(ctx, *property, &text_buf);
            if (text == NULL ||
                (strcmp(text, "whenEmpty") != 0 && strcmp(text, "latest") != 0)) {
                JS_ThrowRangeError(ctx, "camera.open({ grabMode }) expects whenEmpty/latest");
                goto parse_fail;
            }
            config.grab_mode = strcmp(text, "latest") == 0
                                   ? CAMERA_GRAB_LATEST
                                   : CAMERA_GRAB_WHEN_EMPTY;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "bufferLocation");
        if (JS_IsException(*property)) {
            goto parse_fail;
        }
        if (!JS_IsUndefined(*property)) {
            text = JS_ToCString(ctx, *property, &text_buf);
            if (text == NULL ||
                (strcmp(text, "psram") != 0 && strcmp(text, "dram") != 0)) {
                JS_ThrowRangeError(ctx, "camera.open({ bufferLocation }) expects psram/dram");
                goto parse_fail;
            }
            config.fb_location = strcmp(text, "psram") == 0
                                     ? CAMERA_FB_IN_PSRAM
                                     : CAMERA_FB_IN_DRAM;
        }
        *pins_obj = JS_GetPropertyStr(ctx, argv[0], "pins");
        if (JS_IsException(*pins_obj)) {
            goto parse_fail;
        }
        if (!JS_IsUndefined(*pins_obj)) {
            if (JS_GetClassID(ctx, *pins_obj) < 0 ||
                JS_IsArray(ctx, *pins_obj) ||
                !camera_read_optional_i32(ctx, *pins_obj, "pwdn", &config.pin_pwdn) ||
                !camera_read_optional_i32(ctx, *pins_obj, "reset", &config.pin_reset) ||
                !camera_read_optional_i32(ctx, *pins_obj, "xclk", &config.pin_xclk) ||
                !camera_read_optional_i32(ctx, *pins_obj, "sccbSda", &config.pin_sccb_sda) ||
                !camera_read_optional_i32(ctx, *pins_obj, "sccbScl", &config.pin_sccb_scl) ||
                !camera_read_optional_i32(ctx, *pins_obj, "d0", &config.pin_d0) ||
                !camera_read_optional_i32(ctx, *pins_obj, "d1", &config.pin_d1) ||
                !camera_read_optional_i32(ctx, *pins_obj, "d2", &config.pin_d2) ||
                !camera_read_optional_i32(ctx, *pins_obj, "d3", &config.pin_d3) ||
                !camera_read_optional_i32(ctx, *pins_obj, "d4", &config.pin_d4) ||
                !camera_read_optional_i32(ctx, *pins_obj, "d5", &config.pin_d5) ||
                !camera_read_optional_i32(ctx, *pins_obj, "d6", &config.pin_d6) ||
                !camera_read_optional_i32(ctx, *pins_obj, "d7", &config.pin_d7) ||
                !camera_read_optional_i32(ctx, *pins_obj, "vsync", &config.pin_vsync) ||
                !camera_read_optional_i32(ctx, *pins_obj, "href", &config.pin_href) ||
                !camera_read_optional_i32(ctx, *pins_obj, "pclk", &config.pin_pclk)) {
                JS_ThrowTypeError(ctx, "camera.open({ pins }) received invalid pin values");
                goto parse_fail;
            }
        }
        JS_PopGCRef(ctx, &pins_ref);
        JS_PopGCRef(ctx, &property_ref);
        goto parsed;

