99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/camera/esp32_mquickjs_camera.c
parse_fail:
        JS_PopGCRef(ctx, &pins_ref);
        JS_PopGCRef(ctx, &property_ref);
        return JS_EXCEPTION;
    }

parsed:
    config.fb_count = (size_t)frame_buffers;
    if (!((config.fb_count == 1 && config.grab_mode == CAMERA_GRAB_WHEN_EMPTY) ||
          (config.fb_count == 2 && config.grab_mode == CAMERA_GRAB_LATEST))) {
        return JS_ThrowRangeError(
            ctx,
            "camera.open() requires 1/whenEmpty or explicitly 2/latest framebuffer mode");
    }
    if (config.fb_location == CAMERA_FB_IN_PSRAM &&
        !camera_psram_is_initialized()) {
        return JS_ThrowInternalError(ctx,
                                     "camera.open() requested PSRAM but PSRAM is unavailable");
    }
    pins[0] = config.pin_xclk;
    pins[1] = config.pin_sccb_sda;
    pins[2] = config.pin_sccb_scl;
    pins[3] = config.pin_d0;
    pins[4] = config.pin_d1;
    pins[5] = config.pin_d2;
    pins[6] = config.pin_d3;
    pins[7] = config.pin_d4;
    pins[8] = config.pin_d5;
    pins[9] = config.pin_d6;
    pins[10] = config.pin_d7;
    pins[11] = config.pin_vsync;
    pins[12] = config.pin_href;
    pins[13] = config.pin_pclk;
    for (i = 0; i < sizeof(pins) / sizeof(pins[0]); ++i) {
        size_t other;

        if (pins[i] < 0 || pins[i] >= GPIO_NUM_MAX ||
            !GPIO_IS_VALID_GPIO(pins[i])) {
            return JS_ThrowTypeError(
                ctx,
                "camera.open() requires a complete explicit or hardware-profile pin map");
        }
        for (other = 0; other < i; ++other) {
            if (pins[i] == pins[other]) {
                return JS_ThrowRangeError(
                    ctx, "camera.open() requires distinct signal GPIOs");
            }
        }
    }
    if (!GPIO_IS_VALID_OUTPUT_GPIO(config.pin_xclk) ||
        (config.pin_pwdn >= 0 && !GPIO_IS_VALID_OUTPUT_GPIO(config.pin_pwdn)) ||
        (config.pin_reset >= 0 && !GPIO_IS_VALID_OUTPUT_GPIO(config.pin_reset)) ||
        config.pin_pwdn < -1 || config.pin_reset < -1) {
        return JS_ThrowTypeError(ctx, "camera.open() received invalid output pins");
    }
    if (config.pin_pwdn >= 0 && config.pin_pwdn == config.pin_reset) {
        return JS_ThrowRangeError(
            ctx, "camera.open() requires distinct control GPIOs");
    }
    for (i = 0; i < sizeof(pins) / sizeof(pins[0]); ++i) {
        if ((config.pin_pwdn >= 0 && config.pin_pwdn == pins[i]) ||
            (config.pin_reset >= 0 && config.pin_reset == pins[i])) {
            return JS_ThrowRangeError(
                ctx, "camera.open() requires distinct control GPIOs");
        }
    }
    if (!esp32_mquickjs_peripheral_lease_acquire(
            ESP32_MQUICKJS_PERIPHERAL_CAMERA, 0,
            ESP32_MQUICKJS_PERIPHERAL_OWNER_CAMERA,
            &s_camera.camera_lease) ||
        !esp32_mquickjs_peripheral_lease_acquire(
            ESP32_MQUICKJS_PERIPHERAL_I2C_PORT, CAMERA_SCCB_I2C_PORT,
            ESP32_MQUICKJS_PERIPHERAL_OWNER_CAMERA, &s_camera.i2c_lease) ||
        !esp32_mquickjs_peripheral_lease_acquire_any(
            ESP32_MQUICKJS_PERIPHERAL_LEDC_TIMER, SOC_LEDC_TIMER_NUM,
            ESP32_MQUICKJS_PERIPHERAL_OWNER_CAMERA,
            &s_camera.ledc_timer_lease) ||
        !esp32_mquickjs_peripheral_lease_acquire_any(
            ESP32_MQUICKJS_PERIPHERAL_LEDC_CHANNEL, SOC_LEDC_CHANNEL_NUM,
            ESP32_MQUICKJS_PERIPHERAL_OWNER_CAMERA,
            &s_camera.ledc_channel_lease)) {
        camera_release_leases();
        return JS_ThrowInternalError(ctx,
                                     "camera.open() could not reserve camera/SCCB/LEDC resources");
    }
    config.ledc_timer = (ledc_timer_t)s_camera.ledc_timer_lease.index;
    config.ledc_channel = (ledc_channel_t)s_camera.ledc_channel_lease.index;
    err = esp_camera_init(&config);
    if (err != ESP_OK) {
        camera_release_leases();
        return JS_ThrowInternalError(ctx, "camera.open() failed: %s",
                                     esp_err_to_name(err));
    }
    s_camera.sensor = esp_camera_sensor_get();
    if (s_camera.sensor == NULL ||
        (s_camera.sensor->id.PID != OV2640_PID &&
         s_camera.sensor->id.PID != OV3660_PID)) {
        (void)esp_camera_deinit();
        camera_release_leases();
        memset(&s_camera, 0, sizeof(s_camera));
        return JS_ThrowInternalError(ctx,
                                     "camera.open() detected an unsupported sensor");
    }
    s_camera.allocated = true;
    s_camera.initialized = true;
    s_camera.generation = camera_take_generation();
    s_camera.default_timeout_ms = timeout_ms;
    s_camera.pixel_format = config.pixel_format;
    s_camera.frame_size = config.frame_size;
    s_camera.jpeg_quality = config.jpeg_quality;
    s_camera.frame_buffers = config.fb_count;
    s_camera.grab_mode = config.grab_mode;
    s_camera.buffer_location = config.fb_location;
    result = camera_make_object(ctx);
    if (JS_IsException(result)) {
        camera_cleanup();
    }
    return result;
}

#endif
